python3Dangerator.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-19 Sat 23:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python Dangerators</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="blog.css">
</head>
<body>
<div id="content">
<h1 class="title">Python Dangerators</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1f1bba7">1. Python 3 - Iterators should be called Dangerators</a>
<ul>
<li>
<ul>
<li><a href="#org71d7427">1.0.1. Enter Python 3:</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1f1bba7" class="outline-2">
<h2 id="org1f1bba7"><span class="section-number-2">1</span> Python 3 - Iterators should be called Dangerators</h2>
<div class="outline-text-2" id="text-1">
<p>
In the old Python 2 days, working with lists was pleasant and easy:
</p>

<pre class="example">
$ python
Python 2.7.18 (default, Apr 19 2020, 21:45:35)
[GCC 9.3.0] on linux2
Type "help", "copyright", "credits" or "license" for more information.
&gt;&gt;&gt; a = [1,2,3]
&gt;&gt;&gt; b = []
&gt;&gt;&gt; len(a)
3
&gt;&gt;&gt; a[1]
2
&gt;&gt;&gt;
</pre>

<p>
Lists had implicit boolean values of false-ish for an empty list and
truthy for a non-empty list:
</p>

<pre class="example">
&gt;&gt;&gt; "non-empty" if a else "empty"
'non-empty'
&gt;&gt;&gt; "non-empty" if b else "empty"
'empty'
&gt;&gt;&gt;

&gt;&gt;&gt; whenNonEmpty = lambda l: l if l else "empty"
&gt;&gt;&gt; whenNonEmpty(a)
[1, 2, 3]
&gt;&gt;&gt; whenNonEmpty(b)
'empty'
&gt;&gt;&gt;
</pre>

<p>
And there are some useful functions to apply over the contents of
lists, that work with empty and non-empty lists:
</p>

<pre class="example">
&gt;&gt;&gt; map(chr, a)
['\x01', '\x02', '\x03']
&gt;&gt;&gt; map(chr, b)
[]

&gt;&gt;&gt; filter(None, a)
[1,2,3]
&gt;&gt;&gt; filter(None, b)
[]
</pre>

<p>
Note also that list comprehensions are equivalent to <code>map</code> and <code>filter</code>:
</p>

<pre class="example">
&gt;&gt;&gt; map(chr, a)
['\x01', '\x02', '\x03']
&gt;&gt;&gt; [ chr(x) for x in a ]
['\x01', '\x02', '\x03']
&gt;&gt;&gt;

&gt;&gt;&gt; filter(None, a)
[1, 2, 3]
&gt;&gt;&gt; [ x for x in a if x is not None ]
[1, 2, 3]
&gt;&gt;&gt;

</pre>

<p>
Combining these functions (composition) is also simple and easy:
</p>

<pre class="example">
&gt;&gt;&gt; whenNonEmpty(filter(None, map(chr, a)))
['\x01', '\x02', '\x03']
&gt;&gt;&gt; whenNonEmpty(filter(None, map(chr, b)))
'empty'
</pre>

<p>
Life was good, things worked like one would expect.
</p>
</div>

<div id="outline-container-org71d7427" class="outline-4">
<h4 id="org71d7427"><span class="section-number-4">1.0.1</span> Enter Python 3:</h4>
<div class="outline-text-4" id="text-1-0-1">
<p>
In Python3, <code>filter</code> and <code>map</code> (and <code>reduce</code>) were changed to return
iterator objects instead of lists.  This was done for performance
reasons (better memory consumption, potential for lazy evaluation),
but it has significant, unexpected, and sometimes hidden impacts to
the surface functionality.
</p>

<p>
It starts out similarly:
</p>

<pre class="example">
$ python
Python 3.8.6 (default, Sep 23 2020, 13:54:27)
[GCC 9.3.0] on linux
Type "help", "copyright", "credits" or "license" for more information.
&gt;&gt;&gt; a = [1,2,3]
&gt;&gt;&gt; b = []
&gt;&gt;&gt; len(a)
3
&gt;&gt;&gt; a[1]
2
</pre>

<p>
But using map or filter returns iterators:
</p>

<pre class="example">
&gt;&gt;&gt; map(chr, a)
&lt;map object at 0x7fcb0638f0a0&gt;
# Python 2: ['\x01', '\x02', '\x03']

&gt;&gt;&gt; map(chr, b)
&lt;map object at 0x7fcb0642cb80&gt;
# Python 2: []

&gt;&gt;&gt; filter(None, a)
&lt;filter object at 0x7fcb06417640&gt;
# Python 2: ['\x01', '\x02', '\x03']

&gt;&gt;&gt; filter(None, b)
&lt;filter object at 0x7fcb0642cc70&gt;
# Python 2: []
</pre>

<p>
These iterator objects are <b>not</b> list containers:
</p>

<pre class="example">
&gt;&gt;&gt; map(chr, a)[1]
Traceback (most recent call last):
  File "&lt;stdin&gt;", line 1, in &lt;module&gt;
TypeError: 'map' object is not subscriptable

&gt;&gt;&gt; len(filter(None, a))
Traceback (most recent call last):
  File "&lt;stdin&gt;", line 1, in &lt;module&gt;
TypeError: object of type 'filter' has no len()
&gt;&gt;&gt; 
</pre>

<p>
To use them with list functions, they must be converted back into lists:
</p>

<pre class="example">
&gt;&gt;&gt; list(map(chr, a))[1]
'\x02'
&gt;&gt;&gt; len(list(filter(None, a)))
3
&gt;&gt;&gt;
</pre>

<p>
This is one of the initial areas that caused problems when migrating
from Python2 to Python3.  So far, this was a situation that generated
<span class="underline">errors</span> (hopefully during your CI if your tests were thorough
enough).  
</p>

<p>
However, the truthiness of iterators also changes (because it's now a
different object), but silently:
</p>

<pre class="example">
&gt;&gt;&gt; "non-empty" if map(chr, a) else "empty"
'non-empty'
# same as Python 2
&gt;&gt;&gt; "non-empty" if map(chr, b) else "empty"
'non-empty'
# Python 2: returned 'empty'  !!!
&gt;&gt;&gt;
</pre>

<p>
Silent behavioral changes like this are hugely problematic.  Because
these don't generate errors, your CI testing needs to be extremely
thorough to catch this type of thing&#x2026; and I'm not sure many of us
have that high of a level of confidence in the branch coverage of our
tests.  In addition, I maintain that this is <span class="underline">unexpected and
surprising</span> behavior to code readers.  Python has a long and broad
history of truthiness for objects that many Python programmers are
used to, but in my opinion this deviation here violates several of
the Zen of Python mantras (PEP-20):
</p>

<ul class="org-ul">
<li>"Readability counts."</li>
<li>"Special cases aren't special enough to break the rules."</li>
<li>"Errors should never pass silently."</li>
<li>"There should be one&#x2013; and preferably only one &#x2013;obvious way to do it."</li>
<li>"If the implementation is hard to explain, it's a bad idea."</li>
</ul>

<p>
I realize that you might counter here with assertions like "these
aren't actually errors" and "this makes total sense if you understand
iterators" and you're technically correct, but my position is that
these are subtle and therefore dangerous differences that lead to
unintentional programmer mistakes&#x2026; which is counter to the raison
d'être of Python.
</p>

<p>
And it gets worse, as I shall demonstrate.
</p>

<p>
Iterators do compose:
</p>

<pre class="example">
&gt;&gt;&gt; filter(None, map(chr, a))
&lt;filter object at 0x7fcb06383730&gt;
&gt;&gt;&gt;
</pre>

<p>
which perpetuates the perception that they are just like lists, but
this perception breaks down because it's limited to just a very few
special functions:
</p>

<pre class="example">
&gt;&gt;&gt; len(filter(None, map(chr, a)))
Traceback (most recent call last):
  File "&lt;stdin&gt;", line 1, in &lt;module&gt;
TypeError: object of type 'filter' has no len()

&gt;&gt;&gt; len(list(filter(None, map(chr, a))))
3
&gt;&gt;&gt;
</pre>

<p>
However, even though iterators are proxies for a list, they don't
replicate all the functionality of the list.
</p>

<pre class="example">
&gt;&gt;&gt; whenNonEmpty = lambda l: l if l else "empty"
&gt;&gt;&gt; whenNonEmpty(a)
[1, 2, 3]
&gt;&gt;&gt; whenNonEmpty(b)
'empty'

&gt;&gt;&gt; whenNonEmpty(filter(None, map(chr, a)))
&lt;filter object at 0x7fcb0642cc70&gt;
&gt;&gt;&gt; whenNonEmpty(filter(None, map(chr, b)))
&lt;filter object at 0x7fcb0633a580&gt;

&gt;&gt;&gt; list(whenNonEmpty(filter(None, map(chr, b))))
[]    # &lt;&lt;&lt;----- should have been 'empty' !
&gt;&gt;&gt; list(whenNonEmpty(filter(None, map(chr, a))))
['\x01', '\x02', '\x03']
&gt;&gt;&gt;
</pre>

<p>
This is essentially the same thing shown previously: the <code>l</code>
parameter to the <code>whenNonEmpty</code> is now an iterator, not a list, so
it's <b>always</b> "truthy", but evaluating the iterator may return a
false-ish object.
</p>

<p>
At this point, the developer might be tempted to fix this in the
<code>whenNonEmpty</code> lambda function, reasoning that the function should be
made robust to whether it's getting a collection or an iterator:
</p>

<pre class="example">
&gt;&gt;&gt; whenNonEmptySafe = lambda l: list(l) if list(l) else "empty"
</pre>

<p>
It's worth noting here that the benefits of having an iterator are
nullified, or perhaps even result in a worse situation than Python 2:
the input is now converted to a list twice, and these are likely to
be separate lists.  Perhaps the duplication could have been avoided
here via a local variable, but if <code>l</code> was passed to other functions
that wanted to be similarly robust to lists v.s. iterators, they
might create additional list copies themselves.  The result is an
unknown number of lists, as compared to Python2 where a single list
would have been passed around.  Furthermore, if the input <code>l</code> was
already a list, another list is still created by this defensive code.
</p>

<p>
However, there's an even worse issue hiding in this updated
<code>whenNonEmptySafe</code> code:
</p>

<pre class="example">
&gt;&gt;&gt; whenNonEmptySafe(a)
[1, 2, 3]
&gt;&gt;&gt; whenNonEmptySafe(b)
'empty'

&gt;&gt;&gt; whenNonEmptySafe(filter(None, map(chr, a)))
[]
&gt;&gt;&gt; whenNonEmptySafe(filter(None, map(chr, b)))
'empty'
&gt;&gt;&gt; 
</pre>

<p>
The new <code>whenNonEmptySafe</code> fixed the result for the filtered and
mapped <code>b</code>, but now the filtered and mapped <code>a</code> result is wrong!?!
</p>

<p>
The problem here is that iterators <span class="underline">are not values</span>: they are
suspended computations and when the computation is performed, there
are side-effects.  The iterator computation is <b>not</b> idempotent and
can only safely be performed once.
</p>

<p>
In this case, the <code>... if list(l) ...</code> check in <code>whenNonEmptySafe</code>
correctly converts the input to a list, and correctly determines if
the list is empty (false-ish) or non-empty (truthy) for the if
decision.  However, for the truthy branch, it then tries to return
<code>list(l)</code>, but the iterator has already been consumed.  The iterator
does not indicate that it has been consumed though by throwing an
error, it simply returns a default value: the empty list.
</p>

<p>
This is an extremely subtle behavior to decipher&#x2026; or even detect.
Readers familiar with the distinction between iterators and
collections from other languages will be generally unsurprised by
this, but Python developers, while no less sophisticated, have a very
different expectation of their language as informed by nearly every
other part of that language.
</p>

<p>
Here, the <code>whenNonEmptySafe</code> could be re-written to only perform the
<code>list(l)</code> conversion a single time and result in the correct
behavior, but if the caller <b>also</b> passed this iterator to a
different function, that function would have no way to get the
correct results of the iteration.  The only <span class="underline">safe</span> conclusion then is:
</p>

<ul class="org-ul">
<li>That an iterator must be converted back to a collection at the
generation point, and that it should never be passed to a function
that is expecting a collection.</li>

<li>Functions should <span class="underline">not</span> be written defensively, allowing for both
iterators or collections, but should fail when provided an
iterator (which is not the typical perspective for a "duck-typing"
language).</li>
</ul>

<p>
The original <code>whenNonEmpty</code> definition should be used like this:
</p>

<pre class="example">
&gt;&gt;&gt; whenNonEmpty(a)
[1, 2, 3]
&gt;&gt;&gt; whenNonEmpty(b)
'empty'

&gt;&gt;&gt; whenNonEmpty(list(filter(None, map(chr, a))))
['\x01', '\x02', '\x03']
&gt;&gt;&gt; whenNonEmpty(list(filter(None, map(chr, b))))
'empty'
&gt;&gt;&gt; 
</pre>

<p>
In conclusion, the iterators introduced in Python 3 as returns from
<code>filter</code>, <code>map</code>, and <code>reduce</code> are often very dangerous and care
should be taken when using them.
</p>

<p>
This is probably why the <a href="https://portingguide.readthedocs.io/en/latest/iterators.html">Conservative Python 3 Porting Guide</a> contains
the following:
</p>

<blockquote>
<p>
&#x2026; In these cases, the call can be rewritten using a list
comprehension, making the code faster and more readable: &#x2026;
</p>
</blockquote>

<p>
To which I would add "and safer".  In addition, when porting from
Python 2 to Python 3, the guide states
</p>

<blockquote>
<p>
When the recommneded fixers detect calls to <code>map()</code> or <code>filter()</code>,
they add the imports <code>from six.moves import filter</code> or <code>from
   six.moves import map</code> to the top of the file.
</p>

<p>
In many cases the fixers do a good job discerning the different
usages of <code>map()</code> and <code>filter()</code> and, if necessary, adding a call
to <code>list()</code>.  But they are not perfect.  Always review the fixers'
result with the above advice in mind.
</p>
</blockquote>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-12-19 Sat 23:41</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
